# **Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞ Î≥µÏäµ**

## 0.ÌôòÍ≤ΩÏ§ÄÎπÑ + Îç∞Ïù¥ÌÑ∞ Î°úÎìú

* ÎùºÏù¥Î∏åÎü¨Î¶¨ Î∂àÎü¨Ïò§Í∏∞

In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

* Îç∞Ïù¥ÌÑ∞ Í∞ÄÏ†∏Ïò§Í∏∞

In [41]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/sales.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/products.csv")
# products.drop('CategoryOrd', axis =1, inplace = True)
customers = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/customers2.csv")

In [42]:
sales.head()

   OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
0      107    2  2016-01-02  p1036481    2  2100    c150417
1       69    1  2016-01-02  p1152861    1  1091    c212716
2       69    7  2016-01-02  p1013161    1  2600    c212716
3       69    8  2016-01-02  p1005771    1  1650    c212716
4       69   11  2016-01-02  p1089531    1  2600    c212716

In [43]:
products.head()

  ProductID ProductName Category SubCategory
0  p1052661         ÏÉàÏö∞Íπ°       Í∞ÑÏãù          Í≥ºÏûê
1  p1054261       Í≥†Íµ¨ÎßàÏä§Ìã±       Í∞ÑÏãù          Í≥ºÏûê
2  p1097821          Ïß±Íµ¨       Í∞ÑÏãù          Í≥ºÏûê
3  p1097831         Í∞êÏûêÏπ©       Í∞ÑÏãù          Í≥ºÏûê
4  p1119071        ÎøåÏÖîÎøåÏÖî       Í∞ÑÏãù          Í≥ºÏûê

In [44]:
customers.head()

  CustomerID RegisterDate Gender  BirthYear
0    c328222   2014-09-25      F       1960
1    c281448   2013-06-18      F       1974
2    c038336   2003-10-10      F       1968
3    c084237   2007-03-09      F       1982
4    c162600   2010-06-14      F       1978

## 1.Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï°∞Í±¥ Ï°∞ÌöåÌïòÍ∏∞ : .loc

In [45]:
# 1. Íµ¨Îß§Ïï°(Amt)Ïù¥ 10000Ïõê Ïù¥ÏÉÅÏù∏ ÌåêÎß§Ï†ïÎ≥¥Î•º Ï°∞ÌöåÌïòÏãúÏò§.
# sales.loc[Ìñâ Ï°∞Í±¥  , Ïó¥ Ïù¥Î¶Ñ]
# sales.loc[Ìñâ Ï°∞Í±¥]
sales.loc[sales['Amt'] >= 10000]

       OrderID  Seq   OrderDate ProductID  Qty    Amt CustomerID
36          45    8  2016-01-02  p1194801    2  16400    c274126
92           3    7  2016-01-02  p1194801    2  16400    c171257
266         45   24  2016-01-04  p1194801    2  16400    c085558
268         45   29  2016-01-04  p1178011    2  17600    c085558
574         47    5  2016-01-05  p1162631    3  13800    c307738
...        ...  ...         ...       ...  ...    ...        ...
69883       53    1  2017-03-31  p1002841    1  10700    c044830
69895       65    8  2017-03-31  p1139701   10  10450    c219362
69921       83    3  2017-03-31  p1002841    1  10700    c110521
69948      155    7  2017-03-31  p1002841    1  10700    c261935
70002       49    1  2017-03-31  p1002841    1  10700    c343734

[1235 rows x 7 columns]

In [46]:
# 2. 2016ÎÖÑ 2Ïõî ÌåêÎß§ Ï†ïÎ≥¥Î•º Ï°∞ÌöåÌïòÏãúÏò§.
# Ï°∞Í±¥ ÎëêÍ∞ú Ïù¥ÏÉÅ Ïó∞Í≤∞ &(and), |(or), Ï£ºÏùòÏÇ¨Ìï≠ : Ï°∞Í±¥ Í∞ÅÍ∞ÅÏùÑ ()Î°ú Î¨∂Ïñ¥ÏïºÌïúÎã§.
sales['OrderDate'] = pd.to_datetime(sales['OrderDate'])
sales.loc[(sales['OrderDate'] > '2016-01-31') & (sales['OrderDate'] < '2016-03-01')]

      OrderID  Seq  OrderDate ProductID  Qty    Amt CustomerID
4499      241    8 2016-02-01  p1012811    2   5000    c206248
4500      241    9 2016-02-01  p1012751    2   2700    c206248
4501      241   11 2016-02-01  p1144371    5  14250    c206248
4502      241   12 2016-02-01  p1179241    1   1500    c206248
4503      241   13 2016-02-01  p1013161    4  12000    c206248
...       ...  ...        ...       ...  ...    ...        ...
8851       25   11 2016-02-29  p1191881    1   1750    c146132
8852       25   12 2016-02-29  p1207281    1   2600    c146132
8853       25   14 2016-02-29  p1005621    1   2900    c146132
8854       25   19 2016-02-29  p1012751    1   1500    c146132
8855       27    1 2016-02-29  p1005621    1   2030    c146132

[4357 rows x 7 columns]

In [47]:
# ü§î3. 2Î≤à Î¨∏Ï†úÎ•º .between()ÏùÑ ÏÇ¨Ïö©Ìï¥ÏÑú Ï°∞ÌöåÌï¥Î≥¥ÏÑ∏Ïöî.
sales.loc[sales['OrderDate'].between('2016-02-01', '2016-02-29')]

      OrderID  Seq  OrderDate ProductID  Qty    Amt CustomerID
4499      241    8 2016-02-01  p1012811    2   5000    c206248
4500      241    9 2016-02-01  p1012751    2   2700    c206248
4501      241   11 2016-02-01  p1144371    5  14250    c206248
4502      241   12 2016-02-01  p1179241    1   1500    c206248
4503      241   13 2016-02-01  p1013161    4  12000    c206248
...       ...  ...        ...       ...  ...    ...        ...
8851       25   11 2016-02-29  p1191881    1   1750    c146132
8852       25   12 2016-02-29  p1207281    1   2600    c146132
8853       25   14 2016-02-29  p1005621    1   2900    c146132
8854       25   19 2016-02-29  p1012751    1   1500    c146132
8855       27    1 2016-02-29  p1005621    1   2030    c146132

[4357 rows x 7 columns]

* .between() : https://pandas.pydata.org/docs/reference/api/pandas.Series.between.html

In [48]:
# 4. ÏÉÅÌíàÎì§ Ï§ëÏóêÏÑú ÌïòÏúÑ Ïπ¥ÌÖåÍ≥†Î¶¨(SubCategory)Í∞Ä ÏÇ¨ÌÉïÎ•ò, Í≥ºÏûê, Îπµ Ïù∏ ÏÉÅÌíàÏùÑ Ï°∞ÌöåÌïòÏãúÏò§. (.isin ÏÇ¨Ïö©)
products.loc[products['SubCategory'].isin(['ÏÇ¨ÌÉï', 'Í≥ºÏûê', 'Îπµ'])]

  ProductID ProductName Category SubCategory
0  p1052661         ÏÉàÏö∞Íπ°       Í∞ÑÏãù          Í≥ºÏûê
1  p1054261       Í≥†Íµ¨ÎßàÏä§Ìã±       Í∞ÑÏãù          Í≥ºÏûê
2  p1097821          Ïß±Íµ¨       Í∞ÑÏãù          Í≥ºÏûê
3  p1097831         Í∞êÏûêÏπ©       Í∞ÑÏãù          Í≥ºÏûê
4  p1119071        ÎøåÏÖîÎøåÏÖî       Í∞ÑÏãù          Í≥ºÏûê
5  p1235451          ÏΩòÏπ©       Í∞ÑÏãù          Í≥ºÏûê
6  p1006281        ÏÜåÎ≥¥Î£®Îπµ       Í∞ÑÏãù           Îπµ
7  p1006411        ÌÜµÎã®Ìå•Îπµ       Í∞ÑÏãù           Îπµ

* .isin() : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isin.html

## 2.ÎÇ†Ïßú Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞

In [49]:
# 1. SalesÏùò ÎÇ†Ïßú Îç∞Ïù¥ÌÑ∞Î•º ÎÇ†Ïßú ÌòïÏãùÏúºÎ°ú Î≥ÄÌôòÌïòÏãúÏò§.
# pd.to_datetime(date, format = '%d/%m/%Y') # format = '%d/%m/%Y' ÏûÖÎ†•ÎêòÎäî ÎÇ†ÏßúÍ∞Ä Ïù¥Îü∞ ÌòïÌÉúÏïº~~ ÎùºÍ≥† ÏïåÎ†§Ï£ºÎäî ÏòµÏÖò
# ÎÇ†Ïßú ÌÉÄÏûÖÏúºÎ°ú Î≥ÄÌôòÌïòÎ©¥, ÎÇ†Ïßú ÏöîÏÜåÎ•º Ï∂îÏ∂ú Ìï† Ïàò ÏûàÎã§.

sales['OrderDate'] = pd.to_datetime(sales['OrderDate']) # format = '%d-%m-%Y'
sales

       OrderID  Seq  OrderDate ProductID  Qty   Amt CustomerID
0          107    2 2016-01-02  p1036481    2  2100    c150417
1           69    1 2016-01-02  p1152861    1  1091    c212716
2           69    7 2016-01-02  p1013161    1  2600    c212716
3           69    8 2016-01-02  p1005771    1  1650    c212716
4           69   11 2016-01-02  p1089531    1  2600    c212716
...        ...  ...        ...       ...  ...   ...        ...
70007       53    4 2017-03-31  p1072601    1  4600    c337999
70008       53    6 2017-03-31  p1178011    1  8800    c337999
70009       55    6 2017-03-31  p1054261    1  2091    c088320
70010       59    4 2017-03-31  p1175481    1  1300    c238056
70011       59    5 2017-03-31  p1013161    1  2950    c238056

[70012 rows x 7 columns]

* .to_datetime : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html
* format : https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [50]:
# 2. sales Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Ïó∞ÎèÑ Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.
# ÎÇ†ÏßúÌòïÏãùÏùò Î≥ÄÏàò.dt.  <==ÎÇ†Ïßú ÏöîÏÜåÍ∞Ä ÌåùÏóÖÏúºÎ°ú...

sales['Year'] = sales['OrderDate'].dt.year
sales

       OrderID  Seq  OrderDate ProductID  Qty   Amt CustomerID  Year
0          107    2 2016-01-02  p1036481    2  2100    c150417  2016
1           69    1 2016-01-02  p1152861    1  1091    c212716  2016
2           69    7 2016-01-02  p1013161    1  2600    c212716  2016
3           69    8 2016-01-02  p1005771    1  1650    c212716  2016
4           69   11 2016-01-02  p1089531    1  2600    c212716  2016
...        ...  ...        ...       ...  ...   ...        ...   ...
70007       53    4 2017-03-31  p1072601    1  4600    c337999  2017
70008       53    6 2017-03-31  p1178011    1  8800    c337999  2017
70009       55    6 2017-03-31  p1054261    1  2091    c088320  2017
70010       59    4 2017-03-31  p1175481    1  1300    c238056  2017
70011       59    5 2017-03-31  p1013161    1  2950    c238056  2017

[70012 rows x 8 columns]

In [51]:
# 3. sales Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Ïõî Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.

sales['Month'] = sales['OrderDate'].dt.month
sales

       OrderID  Seq  OrderDate ProductID  Qty   Amt CustomerID  Year  Month
0          107    2 2016-01-02  p1036481    2  2100    c150417  2016      1
1           69    1 2016-01-02  p1152861    1  1091    c212716  2016      1
2           69    7 2016-01-02  p1013161    1  2600    c212716  2016      1
3           69    8 2016-01-02  p1005771    1  1650    c212716  2016      1
4           69   11 2016-01-02  p1089531    1  2600    c212716  2016      1
...        ...  ...        ...       ...  ...   ...        ...   ...    ...
70007       53    4 2017-03-31  p1072601    1  4600    c337999  2017      3
70008       53    6 2017-03-31  p1178011    1  8800    c337999  2017      3
70009       55    6 2017-03-31  p1054261    1  2091    c088320  2017      3
70010       59    4 2017-03-31  p1175481    1  1300    c238056  2017      3
70011       59    5 2017-03-31  p1013161    1  2950    c238056  2017      3

[70012 rows x 9 columns]

In [52]:
# 4. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò RegisterDateÎ•º ÎÇ†ÏßúÌÉÄÏûÖÏúºÎ°ú Î≥ÄÌôòÌïòÏãúÏò§.

customers['RegisterDate'] = pd.to_datetime(customers['RegisterDate'])
customers

     CustomerID RegisterDate Gender  BirthYear
0       c328222   2014-09-25      F       1960
1       c281448   2013-06-18      F       1974
2       c038336   2003-10-10      F       1968
3       c084237   2007-03-09      F       1982
4       c162600   2010-06-14      F       1978
...         ...          ...    ...        ...
2238    c302101   2013-11-23      F       1981
2239    c213699   2011-11-04      F       1967
2240    c314668   2014-04-25      F       1977
2241    c160301   2010-05-15      F       1953
2242    c181797   2011-01-26      F       1981

[2243 rows x 4 columns]

In [53]:
# 5. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Îã§Ïùå Îëê Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.
# Îì±Î°ùÏó∞ÎèÑ RegisterYear
# Îì±Î°ùÍ∏∞Í∞Ñ(Îì±Î°ùÏó∞ÎèÑÎ∂ÄÌÑ∞ ÌòÑÏû¨ÍπåÏßÄÏùò ÎÖÑ Ïàò)

customers['RegisterYear'] = customers['RegisterDate'].dt.year
customers['Duration'] = 2024 - customers['RegisterYear'] 
customers.head()

  CustomerID RegisterDate Gender  BirthYear  RegisterYear  Duration
0    c328222   2014-09-25      F       1960          2014        10
1    c281448   2013-06-18      F       1974          2013        11
2    c038336   2003-10-10      F       1968          2003        21
3    c084237   2007-03-09      F       1982          2007        17
4    c162600   2010-06-14      F       1978          2010        14

In [54]:
# 6. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê ÎÇòÏù¥Î•º Í≥ÑÏÇ∞Ìï¥ÏÑú Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.

customers['Age'] = 2024 - customers['BirthYear']
customers.head()

  CustomerID RegisterDate Gender  BirthYear  RegisterYear  Duration  Age
0    c328222   2014-09-25      F       1960          2014        10   64
1    c281448   2013-06-18      F       1974          2013        11   50
2    c038336   2003-10-10      F       1968          2003        21   56
3    c084237   2007-03-09      F       1982          2007        17   42
4    c162600   2010-06-14      F       1978          2010        14   46

In [55]:
# 7. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóêÏÑú ÎÇòÏù¥Î°ú Î∂ÄÌÑ∞ Ïó∞Î†πÎåÄÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§. pd.cut
# Ïà´ÏûêÌòï Î≥ÄÏàòÎ•º Î≤îÏ£ºÎ°ú Î≥ÄÌôòÌï¥Ï£ºÍ∏∞.

customers['AgeGroup'] = pd.cut(customers['Age'], 
                               bins = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
                               labels = ['age_0', 'age_10', 'age_20', 'age_30', 'age_40', 'age_50', 'age_60', 'age_70', 'age_80', 'age_90'])
customers.head()

,CustomerID,RegisterDate,Gender,BirthYear,RegisterYear,Duration,Age,AgeGroup
0,c328222,2014-09-25,F,1960,2014,10,64,age_60
1,c281448,2013-06-18,F,1974,2013,11,50,age_40
2,c038336,2003-10-10,F,1968,2003,21,56,age_50
3,c084237,2007-03-09,F,1982,2007,17,42,age_40
4,c162600,2010-06-14,F,1978,2010,14,46,age_40

pd.cut ÏÑ§Î™Ö (https://pandas.pydata.org/docs/reference/api/pandas.cut.html)

## 3.ÏßëÍ≥Ñ : value_counts(), groupby()

* value_counts() : https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html
* groupby() : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [56]:
# 1.Category Î≥Ñ ÏÉÅÌíà ÏàòÎ•º Ï°∞ÌöåÌïòÏãúÏò§.(.value_counts())
products['Category'].value_counts()

Category
Ï±ÑÏÜå     23
Ïú†Ï†úÌíà    14
Í∞ÑÏãù     11
Î∞òÏ∞¨Î•ò     8
Í≥ºÏùº      6
Name: count, dtype: int64

In [57]:
# 2. Ï∂úÏÉù Ïó∞ÎèÑÎ≥Ñ ÌöåÏõêÏàò(.value_counts())
customers['BirthYear'].value_counts()

BirthYear
1973    122
1971    116
1974    107
1979    105
1970    104
       ...
1932      2
1936      1
1994      1
1995      1
1999      1
Name: count, Length: 62, dtype: int64

In [58]:
# 3. 2016ÎÖÑ ÏõîÎ≥Ñ, Îß§Ï∂úÏï°Í≥º Ï¥ù ÌåêÎß§ÏàòÎüâ(sum)ÏùÑ Ï°∞Ìöå. (.groupby)
sales.groupby(['Month','Amt'], as_index=False)['Qty'].sum()

      Month    Amt  Qty
0         1 -34800  -12
1         1 -20750   -5
2         1 -15800   -1
3         1 -14500   -1
4         1  -9300   -2
...     ...    ...  ...
3077     12  18400    4
3078     12  18600   36
3079     12  19656   72
3080     12  25110    6
3081     12  28917   21

[3082 rows x 3 columns]

## 4.Í≤∞Ìï© ‚ë† : Ï°∞Ïù∏ join(merge)

* ÌåêÎã§Ïä§ÏóêÏÑú joinÏùÄ ÍµâÏû•Ìûà Í∞ÑÎã®Ìï©ÎãàÎã§.
* ÏûêÎèôÏúºÎ°ú keyÎ•º Ïû°ÏïÑÏ§çÎãàÎã§
* defaultÎ°ú inner joinÏùÑ Ìï©ÎãàÎã§.

In [59]:
# ü§î1. salesÏôÄ productsÎ•º productid Í∏∞Ï§ÄÏúºÎ°ú mergeÌïòÏó¨ ÏÉàÎ°úÏö¥ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏúºÎ°ú Ï†ÄÏû•Ìï©ÎãàÎã§.

temp1 = pd.merge(sales, products)
temp1.head(5)

,OrderID,Seq,OrderDate,ProductID,Qty,Amt,CustomerID,Year,Month,ProductName,Category,SubCategory
0,107,2,2016-01-02,p1036481,2,2100,c150417,2016,1,ÏàúÎëêÎ∂Ä,Î∞òÏ∞¨Î•ò,ÎëêÎ∂Ä
1,69,1,2016-01-02,p1152861,1,1091,c212716,2016,1,Ìè¨ÌÜ†ÏïÑÏù¥Ïä§ÌÅ¨Î¶º,Ïú†Ï†úÌíà,ÏïÑÏù¥Ïä§ÌÅ¨Î¶º
2,69,7,2016-01-02,p1013161,1,2600,c212716,2016,1,ÎäêÌÉÄÎ¶¨Î≤ÑÏÑØ,Ï±ÑÏÜå,Î≤ÑÏÑØ
3,69,8,2016-01-02,p1005771,1,1650,c212716,2016,1,ÎëêÎ∂Ä_ÏÜå,Î∞òÏ∞¨Î•ò,ÎëêÎ∂Ä
4,69,11,2016-01-02,p1089531,1,2600,c212716,2016,1,Í∞êÏûêÏπ©,Ï±ÑÏÜå,ÎøåÎ¶¨Ï±ÑÏÜå

In [60]:
# ü§î2. Category Î≥Ñ Ï¥ù Îß§Ï∂úÏï°(Amt)

temp1.groupby('Category', as_index=False)['Amt'].sum()

  Category       Amt
0       Í∞ÑÏãù  12920570
1       Í≥ºÏùº  49789339
2      Î∞òÏ∞¨Î•ò  32204820
3      Ïú†Ï†úÌíà  45261956
4       Ï±ÑÏÜå  54822783

In [61]:
# ü§î3. Category Î≥Ñ Ï¥ù ÌåêÎß§Îüâ(qty)

temp1.groupby('Category', as_index = False)['Qty'].sum()

  Category    Qty
0       Í∞ÑÏãù  12130
1       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  20210
3      Ïú†Ï†úÌíà  19731
4       Ï±ÑÏÜå  27859

In [62]:
# ü§î4. Ï†ÑÏ≤¥ÏóêÏÑú Í∞ÄÏû• Îß§Ï∂úÏù¥ ÎÜíÏùÄ ÏÉÅÌíàÎ™Ö 10Í∞ú Ï°∞Ìöå

temp2 = temp1.groupby('ProductName', as_index=False)['Amt'].sum()
temp2.sort_values('Amt', ascending = False).head(10)

   ProductName       Amt
37      Ïö∞Ïú†1000  18129067
23        ÏÇ¨Í≥º_ÏÜå  14078818
9         Îî∏Í∏∞_ÎåÄ  11011541
7         ÎëêÎ∂Ä_ÎåÄ  10119037
10        Îî∏Í∏∞_ÏÜå   7517664
8         ÎëêÎ∂Ä_ÏÜå   7319963
49         ÏΩ©ÎÇòÎ¨º   6971347
39       Ïú†Í∏∞ÎÜçÏö∞Ïú†   6437323
50         ÌÜ†ÎßàÌÜ†   6291001
43          Ï∞∏Ïô∏   5491030

* Ï†ïÎ†¨ : .sort_values : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

## 5.Í≤∞Ìï© ‚ë° : Î∂ôÏù¥Í∏∞  concat()

In [63]:
# ü§î1. ÏúÑ Ïã§Ïäµ 4-2,3Î≤àÏùò Í≤∞Í≥ºÎ•º Í∞ÅÍ∞Å dataframeÏúºÎ°ú Ï†ÄÏû•ÌïòÏãúÏò§.
temp3 = temp1.groupby('Category', as_index = False)['Amt'].sum()
temp4 = temp1.groupby('Category', as_index = False)['Qty'].sum()

In [64]:
temp3.head(3)

  Category       Amt
0       Í∞ÑÏãù  12920570
1       Í≥ºÏùº  49789339
2      Î∞òÏ∞¨Î•ò  32204820

In [65]:
temp4.head(3)

  Category    Qty
0       Í∞ÑÏãù  12130
1       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  20210

* ÏòÜÏúºÎ°ú Î∂ôÏù¥Í∏∞ concat(,  axis = 1)

* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html

In [66]:
# ü§î2. ÏòÜÏúºÎ°ú Î∂ôÏù¥Í∏∞ concat(, axis = 1)
pd.concat([temp3, temp4], axis = 1)

  Category       Amt Category    Qty
0       Í∞ÑÏãù  12920570       Í∞ÑÏãù  12130
1       Í≥ºÏùº  49789339       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  32204820      Î∞òÏ∞¨Î•ò  20210
3      Ïú†Ï†úÌíà  45261956      Ïú†Ï†úÌíà  19731
4       Ï±ÑÏÜå  54822783       Ï±ÑÏÜå  27859

In [67]:
# ü§î3. 2016ÎÖÑ 1Ïõî ÌåêÎß§Îç∞Ïù¥ÌÑ∞Î•º Ï†ÄÏû•ÌïòÏãúÏò§.
temp5 = sales.loc[sales['OrderDate'].between('2016-01-01', '2016-02-01', inclusive = 'left')]

# 2017ÎÖÑ 1Ïõî ÌåêÎß§Îç∞Ïù¥ÌÑ∞Î•º Ï†ÄÏû•ÌïòÏãúÏò§.
temp6 = sales.loc[sales['OrderDate'].between('2017-01-01', '2017-02-01', inclusive = 'left')]

# Îëê Îç∞Ïù¥ÌÑ∞Î•º ÏúÑ/ÏïÑÎûòÎ°ú Î∂ôÏù¥ÏãúÏò§.
temp7 = pd.concat([temp5, temp6], axis= 0)
temp7.head()

   OrderID  Seq  OrderDate ProductID  Qty   Amt CustomerID  Year  Month
0      107    2 2016-01-02  p1036481    2  2100    c150417  2016      1
1       69    1 2016-01-02  p1152861    1  1091    c212716  2016      1
2       69    7 2016-01-02  p1013161    1  2600    c212716  2016      1
3       69    8 2016-01-02  p1005771    1  1650    c212716  2016      1
4       69   11 2016-01-02  p1089531    1  2600    c212716  2016      1

## 6.ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞
rollingÏùÄ Ï£ºÎ°ú ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞Ïóê ÎåÄÌï¥ÏÑú Ïù¥ÎèôÌèâÍ∑†Í∞íÏùÑ Íµ¨ÌïòÍ±∞ÎÇò, ÌñâÏùÑ shift(Ïù¥Îèô) ÏãúÌÇ¨ Îïå Ï£ºÎ°ú ÏÇ¨Ïö©Ìï©ÎãàÎã§.
> ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞ : ÌñâÍ≥º ÌñâÏóê ÏãúÍ∞ÑÏàúÏÑúÍ∞Ä ÏûàÎäî Îç∞Ïù¥ÌÑ∞(Ï†ÑÏ†ú : ÏãúÍ∞ÑÏàúÏúºÎ°ú Ï†ïÎ†¨ ÎêòÏñ¥ ÏûàÎäî ÏÉÅÌÉú)

* .shift() : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shift.html
* .rolling : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rolling.html

In [68]:
!pip install pykrx

Requirement already satisfied: pykrx in c:\users\user\anaconda3\lib\site-packages (1.0.48)
Requirement already satisfied: requests in c:\users\user\anaconda3\lib\site-packages (from pykrx) (2.32.2)
Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (from pykrx) (2.2.2)
Requirement already satisfied: datetime in c:\users\user\anaconda3\lib\site-packages (from pykrx) (5.5)
Requirement already satisfied: numpy in c:\users\user\anaconda3\lib\site-packages (from pykrx) (1.26.4)
Requirement already satisfied: xlrd in c:\users\user\anaconda3\lib\site-packages (from pykrx) (2.0.1)
Requirement already satisfied: deprecated in c:\users\user\anaconda3\lib\site-packages (from pykrx) (1.2.14)
Requirement already satisfied: multipledispatch in c:\users\user\anaconda3\lib\site-packages (from pykrx) (0.6.0)
Requirement already satisfied: matplotlib in c:\users\user\anaconda3\lib\site-packages (from pykrx) (3.8.4)
Requirement already satisfied: zope.interface in c:\users\user\anaconda3\lib\site-packages (from datetime->pykrx) (5.4.0)
Requirement already satisfied: pytz in c:\users\user\anaconda3\lib\site-packages (from datetime->pykrx) (2024.1)
Requirement already satisfied: wrapt<2,>=1.10 in c:\users\user\anaconda3\lib\site-packages (from deprecated->pykrx) (1.14.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (23.2)
Requirement already satisfied: pillow>=8 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (2.9.0.post0)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from multipledispatch->pykrx) (1.16.0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas->pykrx) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2024.7.4)
Requirement already satisfied: setuptools in c:\users\user\anaconda3\lib\site-packages (from zope.interface->datetime->pykrx) (69.5.1)

In [69]:
from pykrx import stock
import datetime

# Ïò§Îäò ÎÇ†Ïßú Í∞ÄÏ†∏Ïò§Í∏∞
today = datetime.datetime.now()

# 1ÎÖÑ Ï†Ñ ÎÇ†Ïßú Í≥ÑÏÇ∞
one_year_ago = today - datetime.timedelta(days=365)

# Ï£ºÍ∞Ä Îç∞Ïù¥ÌÑ∞ Îã§Ïö¥Î°úÎìú Î∞è Í∞ÑÎã®Ìïú Ï≤òÎ¶¨
stock = stock.get_market_ohlcv_by_date(one_year_ago.strftime('%Y%m%d'), today.strftime('%Y%m%d'), "030200")
stock.reset_index(inplace = True)
stock = stock[['ÎÇ†Ïßú', 'Ï¢ÖÍ∞Ä', 'Í±∞ÎûòÎüâ']]
stock.columns = ['Date', 'Close', 'Volume']
stock.head()

        Date  Close   Volume
0 2023-09-13  31250  1272677
1 2023-09-14  32000  1049773
2 2023-09-15  32850  1117873
3 2023-09-18  32350   658295
4 2023-09-19  32250   731680

In [70]:
# ü§î1. Ï†ÑÎÇ†, Ï†ÑÏ†ÑÎÇ† Ï£ºÍ∞Ä Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§. (.shift)

stock['Close_lag1'] = stock['Close'].shift()
stock['Close_lag2'] = stock['Close'].shift(2)
stock.head()

        Date  Close   Volume  Close_lag1  Close_lag2
0 2023-09-13  31250  1272677         NaN         NaN
1 2023-09-14  32000  1049773     31250.0         NaN
2 2023-09-15  32850  1117873     32000.0     31250.0
3 2023-09-18  32350   658295     32850.0     32000.0
4 2023-09-19  32250   731680     32350.0     32850.0

In [71]:
# ü§î2. Ï†ÑÏ†ÑÎÇ† ÎåÄÎπÑ Ï†ÑÎÇ† Ï£ºÍ∞Ä Ï¶ùÍ∞ê Î≥ÄÏàò Ï∂îÍ∞Ä (.diff)

stock['Close_diff'] = stock['Close_lag1'].diff()
stock.head()

        Date  Close   Volume  Close_lag1  Close_lag2  Close_diff
0 2023-09-13  31250  1272677         NaN         NaN         NaN
1 2023-09-14  32000  1049773     31250.0         NaN         NaN
2 2023-09-15  32850  1117873     32000.0     31250.0       750.0
3 2023-09-18  32350   658295     32850.0     32000.0       850.0
4 2023-09-19  32250   731680     32350.0     32850.0      -500.0

In [72]:
# ü§î3. 2Î≤à Î≥ÄÏàòÍ∞Ä + Ïù¥Î©¥ 1, ÏïÑÎãàÎ©¥ 0 (np.where)

stock['Diff'] = np.where(stock['Close_diff'] >0, 1, 0)
stock.head()

        Date  Close   Volume  Close_lag1  Close_lag2  Close_diff  Diff
0 2023-09-13  31250  1272677         NaN         NaN         NaN     0
1 2023-09-14  32000  1049773     31250.0         NaN         NaN     0
2 2023-09-15  32850  1117873     32000.0     31250.0       750.0     1
3 2023-09-18  32350   658295     32850.0     32000.0       850.0     1
4 2023-09-19  32250   731680     32350.0     32850.0      -500.0     0

In [73]:
# ü§î4. 3Ïùº Ïù¥ÎèôÌèâÍ∑† Ï£ºÍ∞Ä Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.(rolling().mean())

stock['Close_MA3'] = stock['Close'].rolling(3, min_periods = 1).mean()
stock.head()

,Date,Close,Volume,Close_lag1,Close_lag2,Close_diff,Diff,Close_MA3
0,2023-09-13,31250,1272677,NaN,NaN,NaN,0,31250.000000
1,2023-09-14,32000,1049773,31250.0,NaN,NaN,0,31625.000000
2,2023-09-15,32850,1117873,32000.0,31250.0,750.0,1,32033.333333
3,2023-09-18,32350,658295,32850.0,32000.0,850.0,1,32400.000000
4,2023-09-19,32250,731680,32350.0,32850.0,-500.0,0,32483.333333